#+options: ':nil *:t -:t ::t <:t H:4 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil expand-links:t f:t
#+options: inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+options: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: Test Drive ~citeproc= and =ODS= / =XLSX= export features of =ox-odt= package
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 31.0.50 (Org mode 9.7.11)

#+ODT_PREFERRED_OUTPUT_FORMAT: pdf
#+CITE_EXPORT: csl ../package-el/ox-odt-9.7.14.644/samples/apa.csl
#+OPTIONS: toc:nil num:nil author:nil date:nil
#+BIBLIOGRAPHY: ./bibliography.json

#+ODS_PREFERRED_OUTPUT_FORMAT: xlsx

- Export me to =odt= with =C-c C-e o O=
- Export me to =ods= with =C-c C-e o S=  

* Test drive =citeproc= support

** Intro

Testing
[cite:@butlerJosephButlerFifteen2017]

** References

#+print_bibliography:

* Test drive export to =ODS= (= =OpenDocumentSpreadsheet=)

** A Professor Consolidates the Marks of his students

*** Mark Card for Calculus

#+Name: calculus
| Name     | Ex1 | Ex2 | Ex2 | Ex4 | Ex5 | ResS |
|----------+-----+-----+-----+-----+-----+------|
| Smith    |   2 |   3 |   4 |   6 |   7 |   22 |
| Walker   |   3 |  11 |   5 |   3 |   6 |   28 |
| Graham   |   4 |   5 |   1 |  10 |   7 |   27 |
| Brown    |   7 |  10 |   3 |   4 |  12 |   36 |
| Jones    |  14 |   9 |   1 |   8 |  13 |   45 |
| Thompson |  14 |   4 |  11 |   9 |  11 |   49 |
#+TBLFM: $7=vsum($2..$6);f2

*** Mark Card for Statistics

#+Name: statistics
| Name     | Ex1 | Ex2 | Ex2 | Ex4 | Ex5 | ResS |
|----------+-----+-----+-----+-----+-----+------|
| Thompson |   7 |  10 |   3 |   9 |   5 |   34 |
| Graham   |   5 |  14 |   1 |   5 |   6 |   31 |
| Walker   |   2 |   3 |   3 |  10 |   2 |   20 |
| Brown    |  14 |   9 |  10 |   3 |   8 |   44 |
| Jones    |  11 |  11 |   3 |   1 |   9 |   35 |
| Smith    |   1 |   3 |   5 |   8 |   9 |   26 |
#+TBLFM: $7=vsum($2..$6);f2

*** Consolidated Mark Card for Math

The table `smart-consolidated' uses `org-lookup-first'.  So, the
results computed in this table are reliable even when the order in
which students (= student rows) appear in `calculus' mark card
DIFFERS from the order in which they appear in `statistics' mark
cards.

**** Smart Consolidation using `org-lookup-first'

#+Name: smart-consolidated
| Name   | calculus | statistics | Total |
|--------+----------+------------+-------|
| Brown  |       36 |         44 |    80 |
| Graham |       27 |         31 |    58 |
| Jones  |       45 |         35 |    80 |
#+TBLFM: $2='(org-lookup-first $1 '(remote(calculus, @I$1..@II$1)) '(remote(calculus, @I$7..@II$7)))::$3='(org-lookup-first $1 '(remote(statistics, @I$1..@II$1)) '(remote(statistics, @I$7..@II$7)))::$4=vsum($2..$3);f2

** A Traveller Consolidates his expenses during World Tour

See [[https://orgmode.org/worg/org-tutorials/org-lookups.html][Org tutorial on table lookup functions]]

A report of my expenses during European Tour.  The expenses are in
local currency, and I am interested in consolidated expenses in Euros.

#+TBLNAME: currency-rates
| currency        | abbreviation | euros |
|-----------------+--------------+-------|
| euro            | eur          |     1 |
| Norwegian krone | nok          |  0.14 |
| Swedish krona   | sek          |  0.12 |
| US dollar       | usd          |  0.77 |

#+TBLNAME: total-expenses
|  date | expense          |  sum | currency | rate |  euros |
|-------+------------------+------+----------+------+--------|
|  1.3. | flights          |  324 | eur      |    1 |    324 |
|  4.6. | books and maps   |  243 | usd      | 0.77 | 187.11 |
| 30.7. | rental car       | 8300 | sek      | 0.12 |   996. |
|  2.7. | hotel            | 1150 | sek      | 0.12 |   138. |
|  2.7. | lunch            |  190 | sek      | 0.12 |   22.8 |
|  3.7. | fishing licenses | 1400 | nok      | 0.14 |   196. |
#+TBLFM: $5='(org-lookup-first $4 '(remote(currency-rates,@2$2..@>$2)) '(remote(currency-rates,@2$3..@>$3)))::$6=$5*$3

** Miscellaneous

Each column in `TIMESERIES` is a time-series.

#+NAME: TIMESERIES
|  2 |  3 |
|  4 |  5 |
|  7 | 10 |
| 12 | 1  |

Each column in `TBL2` captures the `min` and `max` of the correponding
column of `TIMESERIES`.

#+NAME: MIN-MAX-ON-TIMESERIES
|  2 |  1 |
| 12 | 10 |
#+TBLFM: @1$1=vmin(remote(TIMESERIES,@1$1..@>$1))
#+TBLFM: @1$2=vmin(remote(TIMESERIES,@1$2..@>$2))
#+TBLFM: @2$1=vmax(remote(TIMESERIES,@1$1..@>$1))
#+TBLFM: @2$2=vmax(remote(TIMESERIES,@1$2..@>$2))

** Transpose a Table

See [[https://orgmode.org/worg/org-hacks.html][Org ad hoc code, quick hacks and workarounds]]

#+TBLNAME: yearly-stats
| year | 2004 | 2005 | 2006 | 2007 | 2008 | 2009 |
|------+------+------+------+------+------+------|
| min  |  401 |  501 |  601 |  701 |  801 |  901 |
| avg  |  402 |  502 |  602 |  702 |  802 |  902 |
| max  |  403 |  503 |  603 |  703 |  803 |  903 |

#+TBLNAME: transpose-of-yearly-stats
|   |   |   |   |
|   |   |   |   |
|   |   |   |   |
|   |   |   |   |
|   |   |   |   |
|   |   |   |   |
|   |   |   |   |
#+TBLFM: @<$<..@>$> = remote(yearly-stats, @$#$@#)

** Choose only some columns from a remote table

See [[https://orgmode.org/worg/org-hacks.html][Org ad hoc code, quick hacks and workarounds]]

#+name: year-2007-stats
| year | 2007 |
| min  |  701 |
| avg  |  702 |
| max  |  703 |
#+TBLFM: $1 = remote(yearly-stats, @@#$1)
#+TBLFM: $2 = remote(yearly-stats, @@#$5)
